{"/about/":{"data":{"":"Hi 👋 I’m Avinash, a passionate Software Engineer specializing in modern technologies that drive digital transformation.","-ai-agents#🧠 AI Agents":"AI-powered automation solutions Machine learning integration Conversational AI interfaces Model Context Protocol (MCP) implementations","-automation#🤖 Automation":"CI/CD pipeline development Infrastructure as Code (IaC) Process automation and orchestration DevOps tooling and integration","-cloud-technologies#☁️ Cloud Technologies":"Scalable cloud architecture Containerization and orchestration Microservices design Cloud-native development","-databases#🗄️ Databases":"Database design and optimization Query performance tuning Data modeling and architecture Both SQL and NoSQL solutions","current-focus#Current Focus":"I’m currently exploring the intersection of AI and DevOps, building tools that make complex operations more accessible through conversational interfaces and intelligent automation.","get-in-touch#Get In Touch":"Email: aavi.sangle@gmail.com LinkedIn: Avinash Sangle Feel free to explore my projects and reach out if you’d like to collaborate!","my-approach#My Approach":"I believe in building solutions that are:\nEfficient: Optimized for performance and resource utilization Scalable: Designed to grow with business needs Maintainable: Clean code with comprehensive documentation User-Focused: Intuitive interfaces that solve real problems","my-expertise#My Expertise":""},"title":"About Avinash Sangle"},"/posts/":{"data":{"technical-blog#Technical Blog":"Technical BlogWelcome to my blog where I share insights, tutorials, and thoughts on software engineering, AI integration, and DevOps automation.\nBlog posts coming soon! I’ll be sharing my experiences with:\nAI Agent development and integration patterns Jenkins automation and DevOps best practices Database optimization techniques Cloud architecture and scalability Model Context Protocol implementations Stay tuned for updates!"},"title":"Blog"},"/projects/":{"data":{"all-repositories#All Repositories":"jenkins-chatbot-pluginAI-powered Jenkins management through natural language (Python) jenkins-mcp-serverMCP server for Jenkins operations (Python) calculator-serverGo-based MCP server for mathematical computations (Go) SMSSyncSMS gateway for Android - Open source contribution (Java) View All RepositoriesComplete portfolio of projects and contributions on GitHub For more projects and contributions, visit my GitHub profile.\nEach project demonstrates different aspects of my technical skills and approach to solving real-world problems.","my-projects#My Projects":"My ProjectsHere are some of my projects that showcase my expertise in AI integration, DevOps automation, and software engineering. You can find all my work on GitHub.\nJenkins MCP ServerMCP server for Jenkins integration - enabling AI agents to interact with Jenkins Jenkins Chatbot PluginConversational AI interface for Jenkins operations and build management Calculator ServerGo-based MCP server providing mathematical computation capabilities for AI applications"},"title":"Projects"},"/projects/project1/":{"data":{"":"What it does: Implements an MCP (Model Context Protocol) server in Jenkins, enabling external clients—particularly LLM-based tools—to interact programmatically with Jenkins jobs, builds, and context. Includes built-in tools such as whoAmI, job status, and build logs. Why it matters: Bridges the gap between AI agents and Jenkins, allowing for deeper integration, automation, and AI-assisted DevOps workflows. Tech Stack / Highlights: Built as a Jenkins plugin using Java; supports extensible MCP interface. GitHub Repository: jenkins-mcp-server","other-projects#Other Projects":"Jenkins Chatbot PluginConversational AI interface for Jenkins operations Calculator ServerGo-based MCP server for mathematical computations SMSSyncSMS gateway for Android (Java) View All ProjectsComplete portfolio on GitHub"},"title":"Jenkins MCP Server"},"/projects/project2/":{"data":{"":"What it does: Embeds an AI-powered chat interface within Jenkins, letting users manage builds, deployments, and system tasks using natural language—while respecting Jenkins security and access control. Why it matters: Reduces friction and accelerates CI/CD workflows by transforming complex Jenkins interactions into conversational commands. Context: Developed as part of my drive to explore AI-enhanced DevOps tooling. Tech Stack / Highlights: Built with Python, integrating AI capabilities with Jenkins infrastructure. GitHub Repository: jenkins-chatbot-plugin","other-projects#Other Projects":"Jenkins MCP ServerMCP server for Jenkins integration - AI agents interaction Calculator ServerGo-based MCP server for mathematical computations SMSSyncSMS gateway for Android (Java) View All ProjectsComplete portfolio on GitHub"},"title":"Jenkins Chatbot Plugin"},"/projects/project3/":{"data":{"":"What it does: Implements a robust MCP (Model Context Protocol) server in Go that provides mathematical computation tools for AI agents and applications. Supports basic arithmetic, advanced calculations, and mathematical operations through a standardized protocol interface. Why it matters: Demonstrates Go programming expertise and showcases integration of computational services with AI systems through the MCP protocol. Enables AI agents to perform reliable mathematical operations in a distributed architecture. Tech Stack / Highlights: Built with Go for high performance and reliability; implements MCP protocol standards for seamless AI integration; provides comprehensive mathematical computation toolkit. GitHub Repository: calculator-server","other-projects#Other Projects":"Jenkins MCP ServerMCP server for Jenkins integration - AI agents interaction Jenkins Chatbot PluginConversational AI interface for Jenkins operations SMSSyncSMS gateway for Android (Java) View All ProjectsComplete portfolio on GitHub"},"title":"Calculator Server"}}